insert into buyer(surname, residence, discount)
values ('Горская', 'Сормовский', 0),
	   ('Деркач', 'Нижегородский', 10),
	   ('Забегалова', 'Советский', 5),
	   ('Кузнецова', 'Автозаводский', 15),
	   ('Судаева', 'Автозаводский', 10),
	   ('Медведев', 'Нижегородский', 0),
	   ('Путин', 'Приокский', 15),
	   ('Киселев', 'Советский', 5),
	   ('Козырьков', 'Московский', 0),
	   ('Удалова', 'Канавинский', 10);
	   

insert into shop(name_shop, locations, commission)
values ('Валентинка', 'Нижегородский', 0),
	   ('Дудочка', 'Сормовский', 10),
	   ('Библиотека', 'Советский', 5),
	   ('Читайка', 'Автозаводский', 15),
	   ('Расширяем знания', 'Автозаводский', 10),
	   ('Помпончик', 'Нижегородский', 0),
	   ('Новогодние подарки здесь!', 'Приокский', 15),
	   ('Все для тебя', 'Ленинский', 5),
	   ('Удиви себя', 'Московский', 0),
	   ('Почитайка', 'Канавинский', 10);
	   
insert into books(name_book, costs, warehouse, quantity)
values ('Как установить Windows самостоятельно', 5000, 'Нижегородский', 3),
	   ('Капитанская дочка. Оригинал', 60000, 'Сормовский', 1),
	   ('Пиковая дама', 10000, 'Советский', 5),
	   ('Руслан и Людмила', 15000, 'Советский', 15),
	   ('Сказка о царе Салтане', 7300, 'Автозаводский', 10),
	   ('Дубровский', 2000, 'Нижегородский', 3),
	   ('Медный всадник', 4500, 'Нижегородский', 15),
	   ('Windows - руководство', 1000, 'Ленинский', 5),
	   ('Windows 7 и xp', 3800, 'Московский', 5),
	   ('Выстрел', 8900, 'Канавинский', 10),
	   ('Медный всадник', 4500, 'Автозаводский', 13),
	   ('Аватар', 6000, 'Нижегородский', 12),
	   ('Авторизация Windows', 6000, 'Нижегородский', 12);
	   
insert into buy(date_buy,seller, buyer, book, amount, summ)
values ('2019-01-03 14:05:15', 1, 2, 7, 14, 63000),
	   ('2019-05-04 14:06:14', 2, 1, 2, 1, 60000),
	   ('2019-07-05 14:07:13', 2, 4, 1, 2, 10000),
	   ('2019-03-19 14:08:12', 4, 2, 10, 7, 62300),
	   ('2019-03-22 14:09:11', 3, 8, 4, 2, 30000),
	   ('2019-04-30 14:10:10', 1, 8, 3, 2, 20000),
	   ('2019-04-12 14:11:09', 7, 2, 5, 2, 14600),
	   ('2019-09-14 14:12:08', 1, 5, 3, 2, 20000),
	   ('2019-09-02 14:13:07', 3, 6, 4, 2, 30000),
	   ('2019-10-18 14:14:06', 1, 10, 5, 2, 14600);
	   